{
  "company_name": "Standard Chartered Bank Pakistan Limited (SCBPL)",
  "company_logo": "https://cdn.jsdelivr.net/npm/@fortawesome/fontawesome-free@6/svgs/solid/building.svg",
  "company_overview": {
    "business_description": "سٹینڈرڈ چارٹرڈ بینک پاکستان لمیٹڈ ایک بین الاقوامی بینک ہے جو پاکستان میں تجارتی اور رٹیل بینکنگ خدمات فراہم کرتا ہے۔ یہ سٹینڈرڈ چارٹرڈ گروپ کا حصہ ہے، جو ایک برطانوی بینکاری اور مالیاتی خدمات کی کمپنی ہے جس کی جڑیں 1853 میں ہندوستانی برصغیر میں ہیں۔ پاکستان میں اس کی موجودگی پرانی اور قائم شدہ ہے، جو ملک کی آزادی سے قبل کے دور سے خدمات فراہم کر رہی ہے۔ بینک کارپوریٹ بینکنگ، رٹیل بینکنگ، ٹریژری، اور ایسٹ منیجمینٹ سروسز مہیا کرتا ہے۔ اس کی مینجمنٹ بین الاقوامی معیارات پر پوری اترتی ہے اور عالمی بینکاری کے تجربے سے مالا مال ہے۔",
    "number_of_business_segments": "3",
    "market_position_highlights": "پاکستان میں قائم شدہ بین الاقوامی بینک، سٹینڈرڈ چارٹرڈ گروپ کا حصہ، کارپوریٹ اور اعلیٰ نیٹ ورتھ انفرادی کلائنٹس پر مضبوط توجہ، جدید ڈیجیٹل بینکنگ سہولیات۔"
  },
  "key_financial_metrics": {
    "market_capitalization": "Rs 267.99 billion",
    "share_price": "Rs 69.00",
    "eps": "Rs 7.73 (سالانہ بنیاد پر - Q3 2025 EPS Rs 1.93 × 4، کیونکہ 1.54 × 1.25 ≈ 1.93)",
    "pe_ratio": "8.92 (معقول)",
    "roa": "4.37% (بینکاری کے لیے اچھا)",
    "dividend": "Rs 3.50 (2025)",
    "current_ratio": "N/A (بینکوں کا کرنٹ ریشو عام طور پر ناپا نہیں جاتا)",
    "quick_ratio": "N/A (بینکوں کا کوئیک ریشو عام طور پر ناپا نہیں جاتا)",
    "liquidity_metrics": "بینک کی لیکویڈیٹی عام طور پر دیگر ریشوز جیسے ایڈوانس تو ڈپازٹ ریشو سے ناپی جاتی ہے۔",
    "52_week_high": "Rs 85.93",
    "52_week_low": "Rs 49.92",
    "total_assets": "Rs ~6,134 billion (تخمینہ - ROA سے حساب: EPS × Shares / ROA)",
    "total_liabilities": "Rs ~5,866 billion (تخمینہ - کل اثاثوں کا اکثریت)",
    "debt_summary": "بینک کی فطرت کے مطابق قرضے (ڈپازٹس اور دیگر واجبات) بہت زیادہ ہوتے ہیں، یہ بینکاری کاروبار کا حصہ ہے۔",
    "fcff": "دستیاب نہیں",
    "fcfe": "دستیاب نہیں",
    "book_value": "Rs 26.96 فی شیئر"
  },
  "shareholding_structure": {
    "promoters_major_holders": "~75-80% (سٹینڈرڈ چارٹرڈ بینک، یوکے - والدین کمپنی)",
    "institutional_investors": "~15-20%",
    "retail_investors": "~5-10%",
    "others": "~1%"
  },
  "business_segments_products": [
    {
      "segment": "کارپوریٹ اینڈ انسٹی ٹیوشنل بینکنگ",
      "products_services": "کارپوریٹ فنانس، ٹریڈ فنانس، کیپٹل مارکیٹس، کیش مینجمنٹ، کارپوریٹ قرضے۔",
      "revenue_contribution": "~60%"
    },
    {
      "segment": "رٹیل بینکنگ",
      "products_services": "سیونگ/کرنٹ اکاؤنٹس، کریڈٹ کارڈز، پرسنل لونز، گھر کے قرضے، دولت کا انتظام۔",
      "revenue_contribution": "~30%"
    },
    {
      "segment": "ٹریژری اینڈ مارکیٹس",
      "products_services": "فارن ایکسچینج، سود کی مصنوعات، انویسٹمنٹ۔",
      "revenue_contribution": "~10%"
    }
  ],
  "analyst_recommendation": {
    "recommendation": "CAUTIOUS ACCUMULATION IN ZONES Rs 56-64",
    "rationale": "بینک کی بنیادی کارکردگی معقول ہے (P/E: 8.92, ROA: 4.37%) اور یہ مسلسل ڈیویڈنڈ دیتا رہتا ہے۔ تاہم، موجودہ قیمت (Rs 69) اس کی بک ویلیو (Rs 26.96) سے تقریباً 2.56 گنا زیادہ ہے، جو اوور ویلیویشن کا اشارہ دیتی ہے۔ بینک کا قرضہ (ڈپازٹس) فطری طور پر بہت زیادہ ہے، جو بینکاری کاروبار کا حصہ ہے۔ قلیل مدتی ٹریڈنگ کے لیے Rs 64 کا لیول مناسب ہے۔ بہترین ویلیو کے لیے Rs 56 کا لیول انتظار کیا جائے، جہاں پرائس ٹو بک ریشو 2.1 کے قریب آ جاتا ہے اور خطرہ کم ہوتا ہے۔ یہ ایک قائم شدہ بین الاقوامی بینک ہے لیکن موجودہ سطح پر احتیاط کی ضرورت ہے۔"
  },
  "technical_analysis": {
    "chart": "https://example.com/scbpl-chart.jpg",
    "support_levels": "Rs 64.00 (نزدیک ٹریڈنگ سپورٹ), Rs 56.00 (بہترین ویلیو خریداری زون - STRONG VALUE ZONE), Rs 49.92 (52-ہفتہ لو/مضبوط سپورٹ)",
    "resistance_levels": "Rs 72.00, Rs 78.00, Rs 85.93 (52-ہفتہ ہائی)",
    "trend_analysis": "شیئر نے Rs 49.92 سے Rs 85.93 تک مضبوط رن دیکھا ہے۔ موجودہ قیمت Rs 69.00 اس رن کے درمیان میں ہے۔ قیمت حالیہ بلندیوں سے کچھ نیچے آئی ہے۔ اگر قیمت Rs 64 یا Rs 56 کی طرف واپس آتی ہے تو یہ بہتر انٹری پوائنٹس فراہم کر سکتے ہیں۔ رجحان فی الحال غیر جانبدار (Neutral) لگ رہا ہے۔"
  },
  "summary_key_notes": [
    "موجودہ مارکیٹ قیمت: Rs 69.00",
    "TRADING BUY ZONE: Rs 64.00",
    "BEST VALUE BUY ZONE: Rs 56.00",
    "سالانہ EPS (تشخیص): Rs 7.73",
    "PE ریٹیو: 8.92 (بینکاری سیکٹر کے لیے معقول)",
    "بک ویلیو فی شیئر: Rs 26.96",
    "پرائس ٹو بک (P/B) ریشو: 2.56",
    "یعنی مارکیٹ اس کے اثاثوں کی قدر سے 2.56 گنا زیادہ قیمت دے رہی ہے۔ (قدرے اوور ویلیو)",
    "مارکیٹ کیپ: Rs 267.99 ارب",
    "ROA: 4.37% (بینکاری کے لیے اچھا)",
    "ڈیویڈنڈ: Rs 3.50 (ڈیویڈنڈ ییلڈ: ~5.07% - اچھا)",
    "52 ہفتوں کا ہائی: Rs 85.93",
    "52 ہفتوں کا لو: Rs 49.92",
    "بینک کی عمر: پاکستان میں آزادی سے قبل کی موجودگی، انتہائی پرانا اور قائم شدہ بین الاقوامی بینک۔",
    "قرضے کی فطرت: بینک کی فطرت کے مطابق قرضے (ڈپازٹس) بہت زیادہ ہوتے ہیں۔ یہ اس کے کاروبار کا بنیادی حصہ ہے اور خطرہ انتظامیہ کے پورٹ فولیو کے معیار پر منحصر ہے۔",
    "کلیدی طاقتیں: بین الاقوامی برانڈ، مضبوط والدین کی حمایت، قائم شدہ کارپوریٹ کلائنٹ بیس، مستحکم ڈیویڈنڈ۔",
    "کلیدی خطرات: پرائس ٹو بک ریشو زیادہ (2.56)، ملکی معیشت میں سست روی کا اثر، غیر performing ادھار (NPLs) کا خطرہ۔",
    "حتمی نوٹ: یہ ایک معیاری بین الاقوامی بینک ہے، لیکن موجودہ قیمت پر قدرے مہنگا لگتا ہے۔ سرمایہ کاروں کو Rs 56-64 کے زون میں احتیاط سے خریدی کرنی چاہیے۔ Rs 56 کا لیول بہترین ویلیے کا موقع دے سکتا ہے۔ طویل مدتی ڈیویڈنڈ انویسٹر کے لیے اچھا انتخاب ہو سکتا ہے، لیکن بہتر قیمت پر خریدی ضروری ہے۔"
  ]
}